{
    "company-introduction-title": "Company Introduction", 
    "company-introduction-content_1": "UBQTS Power Technology Co., Ltd (hereinafter referred to as UBQTS Power) undertook the renowned testing equipment manufacturer JauTech's technology and team, officially establishing in 2023 and completing a merger in 2024. UBQTS Power expanded its equipment business to Southeast Asia, Europe, and the Americas. During this time, the product performance and technical services were highly recognized and supported by both domestic and international clients.",
    "company-introduction-content_2": "In recent years, UBQTS Power has listened to the needs and suggestions of brand clients, system manufacturers, higher education institutions, and research organizations, developing automated testing equipment and monitoring systems that meet customer expectations for high efficiency, high accuracy, and cost-effectiveness. Customer satisfaction has always been our ultimate goal.",
    "company-introduction-content_3": "UBQTS Power's product development includes proprietary branding, co-development, manufacturing, and integrated marketing. In the future, we will continue to provide equipment solutions and more comprehensive technical services to meet customer needs.",
    "company-introduction-content_4": "We offer complete marketing channels and excellent after-sales services to address customers' production challenges in third-party regions.",
    "company-introduction-content_5": "UBQTS Power's Automated Testing Equipment:",
    "company-introduction-content_6": "(1)BAT Series Automated Testing System: Designed for battery pack development, performance activation, performance classification, battery pack processing, battery pack substrates, etc.",
    "company-introduction-content_7": "(2)DAS Series Modular Automated Monitoring System: Suitable for integration into automated testing or monitoring systems based on customer needs.",
    "company-introduction-content_8": "(3)ATS Multi-purpose Cartridge Equipment.", 
    "company-introduction-content_9": "(4)Collaborative Development & Custom Non-Standard Product Development.", 
    "product-introduction-title": "Production Introduction"
}