{
    "title": "Privacy Policy",
    "content_1": "Welcome to UBQTS Power Technology Co.,Ltd (hereinafter referred to as this website). To ensure you can safely use the services and information provided by this website, we hereby explain our privacy protection policy to safeguard your rights. Please read the following carefully:",
    "content_2": "1. Scope of the Privacy Protection Policy",
    "content_3": "The privacy protection policy includes how this website handles personal identification information collected while you use the website's services. The privacy protection policy does not apply to linked websites outside of this website, nor does it apply to personnel not authorized or involved in the management of this website.",
    "content_4": "2. Collection, Processing, and Use of Personal Data",
    "content_5": "When you visit this website or use the functional services it provides, we may ask you to provide the necessary personal information based on the nature of the service and will process and use your personal data within the specific purpose scope. Without your written consent, this website will not use personal data for other purposes.",
    "content_6": "When you use interactive features such as service mailboxes or surveys, this website will retain the name, email address, contact details, and usage time you provide.",
    "content_7": "During general browsing, the server will automatically record relevant actions, including the IP address of your device, usage time, browser type, and browsing and click data, for internal use to improve website services. These records are for internal use only and will not be disclosed publicly.",
    "content_8": "To provide precise services, we will conduct statistical analysis on collected survey content. The statistical data or explanatory text resulting from the analysis will be published if necessary, but it will not involve specific individual data.",
    "content_9": "3. Data Protection",
    "content_10": "The website's host is equipped with firewalls, antivirus systems, and other related information security equipment and necessary protection measures to protect the website and your personal data. Only authorized personnel can access your personal data, and all personnel involved in processing data have signed confidentiality agreements. Violators of confidentiality obligations will face legal consequences.",
    "content_11": "If it is necessary to entrust other units to provide services due to business needs, this website will strictly require them to comply with confidentiality obligations and take necessary inspection procedures to ensure compliance.",
    "content_12": "4. Links to External Websites",
    "content_13": "The pages of this website provide links to other websites. You can access other websites via these links. However, the privacy protection policy of this website does not apply to the linked websites, and you must refer to the privacy protection policy of the linked websites.",
    "content_14": "5. Policy on Sharing Personal Data with Third Parties",
    "content_15": "This website will never provide, exchange, rent, or sell any of your personal data to individuals, groups, private companies, or public agencies, except when there is a legal basis or contractual obligation.",
    "content_16": "Exceptions to the above include but are not limited to:",
    "content_17": "With your written consent.",
    "content_18": "Explicit legal regulations.",
    "content_19": "To protect your life, body, freedom, or property from danger.",
    "content_20": "When cooperating with public agencies or academic research institutions for public interest purposes in statistics or academic research, where the data is processed or collected without identifying specific individuals.",
    "content_21": "When your behavior on the website violates the terms of service or may harm or hinder the rights of the website or other users, or cause harm to anyone, disclosure of your personal data by the website management unit is necessary for identification, contact, or legal action.",
    "content_22": "To benefit your rights.",
    "content_23": "When the website entrusts vendors to collect, process, or use your personal data, it will supervise and manage the outsourced vendors or individuals.",
    "content_24": "6. Use of Cookies",
    "content_25": "To provide the best service, this website will place and access cookies on your computer. If you do not wish to accept cookies, you can set the privacy level to high in your browser settings to reject cookies. However, some website functions may not work properly.",
    "content_26": "7. Revisions to the Privacy Protection Policy",
    "content_27": "This website's privacy protection policy will be revised as needed, and the revised terms will be published on the website."
}
